n5/src/DataProcessors/UnloadInvoices/UnloadInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>UnloadInvoices</name>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>IncludeWaiting</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Path</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Invoices</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Customer</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Invoice</name>
      <type>
        <types>DocumentRef.InvoiceRecord</types>
      </type>
    </attributes>
    <attributes>
      <name>LoadingPoint</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Memo</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Unload</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Waiting</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

n5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/InvoiceRecord/InvoiceRecord.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InvoiceRecord</name>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.Transfer</basedOn>
  <basedOn>Document.LVITransfer</basedOn>
  <basedOn>Document.VendorReturn</basedOn>
  <basedOn>Document.Sale</basedOn>
  <basedOn>Document.WriteOff</basedOn>
  <basedOn>Document.Return</basedOn>
  <basedOn>Document.AdjustDebts</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachedDocuments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.InvoiceRecordBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Carrier</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Delegated</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>DefinedType.SaleDescription</types>
    </type>
  </attributes>
  <attributes>
    <name>Dispatcher</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstPageRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LoadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>LoadingPoint</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneySeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>PrintBack</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Redirects</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>DefinedType.ReferenceSeries</types>
    </type>
  </attributes>
  <attributes>
    <name>ShowServices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Storekeeper</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingPoint</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>DefinedType.ReferenceSeries</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Discounts</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Refund</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.Refund</types>
        <types>DocumentRef.Debts</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
        <types>CatalogRef.Items</types>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/DataProcessors/UnloadInvoices/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Parameters export;
var JobKey export;
var Meta;
var Metaname;
var XML;
var TempFile;
var DataReader;
var Invoice;
var Object;
var Fields;
var ItemsTable;
var ServicesTable;
var BenefitsTable;
var EmptyDate;

Procedure Exec() export
	
	init();
	initDataReader();
	initXML();
	BeginTransaction();
	for each Invoice in Parameters.Invoices do
		read();
		unload();
		commit();
	enddo;
	CommitTransaction();
	complete();
	
EndProcedure

Procedure init()
	
	Meta = Metadata();
	Metaname = Meta.FullName();
	TempFile = GetTempFileName();
	EmptyDate = Date(1, 1, 1);
	
EndProcedure

Procedure initDataReader()
	
	s = "
	|select Invoices.Company.CodeFiscal as CompanyCodeFiscal, Invoices.Company.FullDescription as Company,
	|	Invoices.Company.VAT as VATPayer, Invoices.Redirects as Redirects,
	|	isnull ( Invoices.Company.PaymentAddress.Address, """" ) as CompanyAddress,
	|	isnull ( Invoices.Account.Bank.Description, """" ) as CompanyBank,
	|	isnull ( Invoices.Account.Bank.Code, """" ) as CompanyBankCode,
	|	isnull ( Invoices.Account.AccountNumber, """" ) as CompanyAccountNumber,
	|	isnull ( Invoices.Customer.CodeFiscal, """" ) as CustomerCodeFiscal, Invoices.Customer.FullDescription as Customer,
	|	isnull ( Invoices.Customer.PaymentAddress.Address, """" ) as CustomerAddress,
	|	isnull ( Invoices.CustomerAccount.Bank.Description, """" ) as CustomerBank,
	|	isnull ( Invoices.CustomerAccount.Bank.Code, """" ) as CustomerBankCode,
	|	isnull ( Invoices.CustomerAccount.AccountNumber, """" ) as CustomerAccountNumber,
	|	isnull ( Invoices.Carrier.CodeFiscal, """" ) as CarrierCodeFiscal, Invoices.Carrier.FullDescription as Carrier,
	|	isnull ( Invoices.Carrier.PaymentAddress.Address, """" ) as CarrierAddress,
	|	isnull ( Invoices.LoadingAddress.Address, """" ) as LoadingAddress,
	|	isnull ( Invoices.UnloadingAddress.Address, """" ) as UnloadingAddress
	|from Document.InvoiceRecord as Invoices
	|where Invoices.Ref = &Ref
	|;
	|select 1 as Table, Items.Item.Code as Code, Items.Item.FullDescription as Item, Items.Item.Unit.Description as Unit,
	|	isnull ( Items.Package.Description, """" ) as Package, isnull ( Items.Item.Weight, 0 ) as Weight,
	|	Items.Item.SKU as SKU, Items.Feature.Description as Feature, Items.Series.Description as Series
	|from Document.InvoiceRecord.Items as Items
	|where Items.Ref = &Ref
	|order by Items.LineNumber
	|;
	|select Services.Item.Code as Code, Services.Description as Item, Services.Item.Unit.Description as Unit
	|from Document.InvoiceRecord.Services as Services
	|where Services.Ref = &Ref
	|order by Services.LineNumber
	|;
	|select Discounts.Item.Code as Code, Discounts.Item.FullDescription as Item, Discounts.Item.Unit.Description as Unit
	|from Document.InvoiceRecord.Discounts as Discounts
	|where Discounts.Ref = &Ref
	|order by Discounts.LineNumber
	|";
	DataReader = new Query(s);
	
EndProcedure

Procedure initXML()
	
	XML = new XMLWriter();
	XML.OpenFile(TempFile, , false);
	XML.WriteXMLDeclaration();
	XML.WriteStartElement("Documents");
	
EndProcedure

Procedure read()
	
	SetPrivilegedMode(true);
	Object = Invoice.GetObject();
	DataReader.SetParameter("Ref", Invoice);
	data = DataReader.ExecuteBatch();
	Fields = data[0].Unload()[0];
	ItemsTable = data[1].Unload();
	ServicesTable = data[2].Unload();
	BenefitsTable = data[3].Unload();
	
EndProcedure

Procedure unload()
	
	XML.WriteStartElement("Document");
	XML.WriteStartElement("SupplierInfo");
	XML.WriteStartElement("DeliveryDate");
	XML.WriteText(XMLString(Object.DeliveryDate));
	XML.WriteEndElement();
	XML.WriteStartElement("Supplier");
	writeAttribute("IDNO", Fields.CompanyCodeFiscal, true);
	writeAttribute("Title", Fields.Company);
	writeAttribute("Address", Fields.CompanyAddress);
	XML.WriteStartElement("BankAccount");
	writeAttribute("BranchTitle", Fields.CompanyBank);
	writeAttribute("BranchCode", TrimR(Fields.CompanyBankCode));
	writeAttribute("Account", Fields.CompanyAccountNumber);
	XML.WriteStartElement("IsManual");
	XML.WriteText("false");
	XML.WriteEndElement();
	XML.WriteEndElement();
	XML.WriteEndElement();
	XML.WriteStartElement("Buyer");
	writeAttribute("IDNO", Fields.CustomerCodeFiscal, true);
	writeAttribute("Title", Fields.Customer);
	writeAttribute("Address", Fields.CustomerAddress);
	XML.WriteStartElement("BankAccount");
	writeAttribute("BranchTitle", Fields.CustomerBank);
	writeAttribute("BranchCode", TrimR(Fields.CustomerBankCode));
	writeAttribute("Account", Fields.CustomerAccountNumber);
	XML.WriteStartElement("IsManual");
	XML.WriteText("false");
	XML.WriteEndElement();
	XML.WriteEndElement();
	XML.WriteEndElement();
	if (Object.Carrier <> undefined) then
		XML.WriteStartElement("Transporter");
		writeAttribute("IDNO", Fields.CarrierCodeFiscal);
		writeAttribute("Title", Fields.Carrier);
		writeAttribute("Address", Fields.CarrierAddress);
		XML.WriteStartElement("BankAccount");
		writeAttribute("BranchTitle", "", true);
		writeAttribute("BranchCode", "", true);
		writeAttribute("Account", "", true);
		XML.WriteStartElement("IsManual");
		XML.WriteText("false");
		XML.WriteEndElement();
		XML.WriteEndElement();
		XML.WriteEndElement();
	endif;
	XML.WriteStartElement("Notes");
	XML.WriteText("" + Object.Ref.UUID());
	XML.WriteEndElement();
	value = Object.AttachedDocuments;
	if (value <> "") then
		XML.WriteStartElement("AttachedDocuments");
		XML.WriteText(value);
		XML.WriteEndElement();
	endif;
	if (Object.PowerAttorneyDate <> EmptyDate
			and Object.PowerAttorneySeries <> ""
			and Object.PowerAttorneyNumber <> "") then
		XML.WriteStartElement("DelegateSeria");
		XML.WriteText(Object.PowerAttorneySeries);
		XML.WriteEndElement();
		XML.WriteStartElement("DelegateNumber");
		XML.WriteText(Object.PowerAttorneyNumber);
		XML.WriteEndElement();
		XML.WriteStartElement("DelegateName");
		XML.WriteText(Object.Delegated);
		XML.WriteEndElement();
		XML.WriteStartElement("DelegateDate");
		XML.WriteText(XMLString(Object.PowerAttorneyDate));
		XML.WriteEndElement();
	endif;
	if (Object.WaybillDate <> EmptyDate
			and Object.WaybillSeries <> ""
			and Object.WaybillNumber <> "") then
		XML.WriteStartElement("VehicleLogbook");
		XML.WriteStartElement("IssuedDate");
		XML.WriteText(XMLString(Object.WaybillDate));
		XML.WriteEndElement();
		XML.WriteStartElement("Seria");
		XML.WriteText(Object.WaybillSeries);
		XML.WriteEndElement();
		XML.WriteStartElement("Number");
		XML.WriteText(Object.WaybillNumber);
		XML.WriteEndElement();
		XML.WriteEndElement();
	endif;
	value = Fields.LoadingAddress;
	if (ValueIsFilled(value)) then
		XML.WriteStartElement("LoadingPoint");
		XML.WriteText(value);
		XML.WriteEndElement();
	endif;
	value = Fields.UnloadingAddress;
	if (ValueIsFilled(value)) then
		XML.WriteStartElement("UnloadingPoint");
		XML.WriteText(value);
		XML.WriteEndElement();
	endif;
	value = Fields.Redirects;
	if (value <> "") then
		XML.WriteStartElement("Redirections");
		XML.WriteText(value);
		XML.WriteEndElement();
	endif;
	rate = Object.Rate;
	factor = Object.Factor;
	XML.WriteStartElement("Merchandises");
	for each row in Object.Items do
		details = ItemsTable[row.LineNumber - 1];
		XML.WriteStartElement("Row");
		writeAttribute("Code", TrimR(details.Code));
		name = Conversion.ValuesToString (
			details.SKU, details.Item, details.Feature, ? ( details.Series = "", "", "#" + details.Series )
		);
		writeAttribute("Name", name, true);
		writeAttribute("UnitOfMeasure", details.Unit, true);
		qty = row.Quantity;
		total = row.Total * rate / factor;
		vat = row.VAT * rate / factor;;
		amount = total - vat;
		writeAttribute("Quantity", qty, true, "NFD=3; NDS=.; NZ=0; NG=");
		writeAttribute("UnitPriceWithoutTVA", amount / qty, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TotalPriceWithoutTVA", amount, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TVA", row.VATRate, true, "NFD=; NDS=.; NZ=0; NG=");
		writeAttribute("TotalTVA", vat, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TotalPrice", total, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("OtherInfo", row.OtherInfo);
		writeAttribute("PackageType", details.Package);
		writeAttribute("NumberOfPlaces", row.QuantityPkg, , "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("GrossWeight", details.Weight * qty, , "NFD=2; NDS=.; NZ=0; NG=");
		XML.WriteEndElement();
	enddo;
	for each row in Object.Services do
		details = ServicesTable[row.LineNumber - 1];
		XML.WriteStartElement("Row");
		writeAttribute("Code", TrimR(details.Code));
		writeAttribute("Name", details.Item, true);
		writeAttribute("UnitOfMeasure", details.Unit, true);
		qty = row.Quantity;
		total = row.Total * rate / factor;;
		vat = row.VAT * rate / factor;;
		amount = total - vat;
		writeAttribute("Quantity", qty, true, "NFD=3; NDS=.; NZ=0; NG=");
		writeAttribute("UnitPriceWithoutTVA", amount / ?(qty = 0, 1, qty), true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TotalPriceWithoutTVA", amount, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TVA", row.VATRate, true, "NFD=; NDS=.; NZ=0; NG=");
		writeAttribute("TotalTVA", vat, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TotalPrice", total, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("OtherInfo", row.OtherInfo);
		XML.WriteEndElement();
	enddo;
	for each row in Object.Discounts do
		details = BenefitsTable[row.LineNumber - 1];
		XML.WriteStartElement("Row");
		writeAttribute("Code", TrimR(details.Code));
		writeAttribute("Name", details.Item, true);
		writeAttribute("UnitOfMeasure", details.Unit, true);
		total = row.Amount * rate / factor;;
		vat = row.VAT * rate / factor;;
		amount = total - vat;
		writeAttribute("Quantity", 0, true, "NFD=3; NDS=.; NZ=0; NG=");
		writeAttribute("UnitPriceWithoutTVA", - amount, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TotalPriceWithoutTVA", - amount, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TVA", row.VATRate, true, "NFD=; NDS=.; NZ=0; NG=");
		writeAttribute("TotalTVA", - vat, true, "NFD=2; NDS=.; NZ=0; NG=");
		writeAttribute("TotalPrice", - total, true, "NFD=2; NDS=.; NZ=0; NG=");
		XML.WriteEndElement();
	enddo;
	XML.WriteEndElement();
	XML.WriteStartElement("CreationMotiv");
	if (Fields.VATPayer) then
		if (Object.Transfer) then
			value = "5";
		else
			value = "4";
		endif;
	else
		if (Object.Transfer) then
			value = "2";
		else
			value = "1";
		endif;
	endif;
	XML.WriteText(value);
	XML.WriteEndElement();
	XML.WriteEndElement();
	XML.WriteEndElement();
	
EndProcedure

Procedure writeAttribute(Name, Value, Mandatory = false, Format = undefined)
	
	if (Mandatory
			or ValueIsFilled(Value)) then
		XML.WriteAttribute(Name, ?(Format = undefined, Value, Format(Value, Format)));
	endif;
	
EndProcedure

Function commit()
	
	Object.Status = Enums.FormStatuses.Waiting;
	try
		Object.Write();
	except
		logError(ErrorDescription());
		return false;
	endtry;
	return true;
	
EndFunction

Procedure logError(Error)
	
	Progress.Put(Error, JobKey, true);
	WriteLogEvent(Metaname, EventLogLevel.Error, Meta, , Error);
	
EndProcedure

Procedure complete()
	
	XML.WriteEndElement();
	XML.Close();
	PutToTempStorage(new BinaryData(TempFile), Parameters.Address);
	DeleteFiles(TempFile);
	
EndProcedure

#endif
